# RvtLinkInstanceName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RvtLinkInstanceName Property
ParameterTypeId Class See Also
---
"Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RvtLinkInstanceName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RvtLinkInstanceName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RvtLinkInstanceName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace